#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/doics/oteldemostack/runs/run-KpnuBgTTFsA8f5MT

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
module.grafana_cloud.grafana_cloud_stack.oteldemo: Refreshing state... [id=395958]
module.grafana_cloud.grafana_cloud_api_key.plugins: Refreshing state... [id=proffalken-plugin-publisher]
module.grafana_cloud.grafana_api_key.management: Refreshing state... [id=2]
module.grafana_cloud.grafana_cloud_api_key.metrics: Refreshing state... [id=proffalken-metrics-publisher]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.heroku_backstage.heroku_addon.backstage_pgsql will be created
  + resource "heroku_addon" "backstage_pgsql" {
      + app_id            = (known after apply)
      + config_var_values = (sensitive value)
      + config_vars       = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + plan              = "heroku-postgresql:hobby-basic"
      + provider_id       = (known after apply)
    }

  # module.heroku_backstage.heroku_app.backstage will be created
  + resource "heroku_app" "backstage" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = (sensitive)
      + region                = (sensitive)
      + sensitive_config_vars = (sensitive value)
      + stack                 = "container"
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # module.heroku_backstage.heroku_app_config_association.backstage will be created
  + resource "heroku_app_config_association" "backstage" {
      + app_id         = (known after apply)
      + id             = (known after apply)
      + sensitive_vars = (sensitive value)
      + vars           = {
          + "GITHUB_AUTH_CLIENT_ID"   = ""
          + "GRAFANA_PROMETHEUS_URI"  = "https://prometheus-prod-01-eu-west-0.grafana.net/api/prom"
          + "GRAFANA_PROMETHEUS_USER" = "492558"
          + "GRAFANA_URI"             = ""
        }
    }

  # module.heroku_backstage.heroku_build.backstage will be created
  + resource "heroku_build" "backstage" {
      + app_id            = (known after apply)
      + buildpacks        = (known after apply)
      + id                = (known after apply)
      + local_checksum    = (known after apply)
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + url      = (sensitive)
        }
    }

  # module.heroku_backstage.heroku_config.backstage_config will be created
  + resource "heroku_config" "backstage_config" {
      + id             = (known after apply)
      + sensitive_vars = (sensitive value)
      + vars           = {
          + "GITHUB_AUTH_CLIENT_ID"   = ""
          + "GRAFANA_PROMETHEUS_URI"  = "https://prometheus-prod-01-eu-west-0.grafana.net/api/prom"
          + "GRAFANA_PROMETHEUS_USER" = "492558"
          + "GRAFANA_URI"             = ""
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @proffalken, Action: `pull_request`*